load-test/load-test.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  variables:
    token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiI3NTE2ODYwNC1kZDNjLTQxYWYtYWM0My1lNGZhMjU3MWMyNTAiLCJyb2xlIjoidXNlciIsImV4cCI6MTc3MzAyOTk5M30.krI5Y3VfDqHVGbCR_fSUNCVSeUKg69XJ8OsU5nk4Ves"

scenarios:
  - name: "Secret operations"
    flow:
      - post:
          url: "/secrets"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            key: "key-{{ $randomString() }}"
            value: "value-{{ $randomString() }}"
      - get:
          url: "/secrets"
          headers:
            Authorization: "Bearer {{ token }}"